# SetClass

## Description
Procedure SetClass assigns a class to the referenced object.&lt;BR&gt;
&lt;BR&gt;

```pascal
PROCEDURE SetClass(
				h     : HANDLE;
				class : STRING);
```

```python

def vs.SetClass(h, class):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|h|HANDLE|Handle to object.|
|class|STRING|Name of class to assign to object.|

## Examples
```pascal
SetClass(ObjHd,'Dimension');

```

## Version
Availability: from MiniCAD
## Category
* Object Attributes